import random

print("🤖電腦：我已經選好了一個１到１００的數字")
print("🤖電腦：你能猜中它是多少嗎？")

#1.電腦出題
secret_number = random.randint(1,100)
count = 0 #計算猜了幾次

#2.遊戲迴圈(True 代表永遠執行，值到遇到 break才會停)
while True:
    count = count + 1

    #3.玩家猜測(記得轉成int)
    guess = int(input(f"{count}次猜測，請輸入數字"))

    #4.判斷邏輯
    if guess == secret_number:
        print(f"🎉賓果! 答對了!答案就是{secret_number}")
        print(f"你總共猜山{count}次。")
        break #<--關鍵!打破迴圈，跳出遊戲

    elif guess > secret_number:
        print("📉太大了!再小一點。。。")

    else:
        print ("📈太小了!再大一點。。。") 

print("---遊戲結束---")   





