# 1. 建立一個空的「資料庫」(其實就是一個 List)
pds_database = []

print("=== 歡迎來到 PDS 會員系統 ===")

while True:
    print("\n --- 新增會員 (輸入 'q' 結束)--- ")
    name = input ("請輸入姓名 : ")

    if name == 'q' :
        break
    goal = input ("請輸入目標 : ")

    #2. 建立一張「會員卡」 (Dictionary)
    # 每次迴圈跑這行，都會產生一個美新的字典
    member = {
        "name" : name,
        "goal" : goal,
        "status" : "Active"  #預設每個會員都是活躍中
    }

    #3.把這張卡片丟進卡片裡 (List)
    pds_database.append(member)
    print(f"✅會員 {name}已存檔!目前共有 {len(pds_database)}人。")

    #  ---輸入結束，列印報表 ---

    print("\n ======================")
    print(f"📊 PDS 系統總報表 (共 {len(pds_database)}人)")
    print("=========================")

    #4. 遍歷資料庫 (這段邏輯稍微難一點，請仔細看)
    # user 變數在每次迴圈中，都會變成期中一個字典
    for user in pds_database:
        #這裡的 user 就是上面存進去的 member
        print(f"👤姓名: {user['name']}")
        print(f"  目標: {user['goal']}")
        print(f"  狀態: {user['status']}")
        print("--------------------")